///*
//	2차원 배열 - 초기화
//*/
//#include <stdio.h>
//
//int main()
//{
//	int ary[4] = { 1,2,3,4 };
//
//	int ary2[3][2] = { {1,2}, {3,4}, {5,6} };
//	int ary3[3][4] = { {1,2}, {3,4,5},{6,7,8,9} };
//	int ary4[3][2] = { 1,2,3,4,5,6 };
//	int ary5[][4] = { {1,2,3,4}, {5,6,7,8} };
//
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 2; j++) {
//			printf("%d, ", ary2[i][j]);
//		}
//	}
//
//	// 4사람의 3과목 점수를 받아서 학생별로 총점
//	int ary6[4][3] = { {10,20,30},{10,20,30},{10,20,30},{10,20,30} };
//	for (int i = 0; i < 4; i++) {
//		int k = 0;
//		for (int j = 0; j < 3; j++) {
//			k += ary6[i][j];
//		}
//		printf("%d, ", k);
//	}
//	return 0;
//}